In [1]:
#dependencies

import pandas as pd

In [2]:
# urls to be scraped

url_min = 'http://www.usa.com/rank/us--average-min-temperature--state-rank.htm?yr=9000&dis=&wist=&plow=&phigh='
url_max = 'http://www.usa.com/rank/us--average-max-temperature--state-rank.htm?yr=9000&dis=&wist=&plow=&phigh='

In [3]:
# use pandas to read html tables

table_min = pd.read_html(url_min)
table_min

[       0                           1                               2
 0   Rank  Average Min. Temperature ▼              State / Population
 1     1.                     65.09°F              Hawaii / 1,392,704
 2     2.                     61.50°F            Florida / 19,361,792
 3     3.                     56.07°F           Louisiana / 4,601,049
 4     4.                     54.16°F              Texas / 26,092,033
 5     5.                     52.26°F         Mississippi / 2,984,345
 6     6.                     51.31°F             Arizona / 6,561,516
 7     7.                     51.01°F             Alabama / 4,817,678
 8     8.                     50.69°F             Georgia / 9,907,756
 9     9.                     49.82°F      South Carolina / 4,727,273
 10   10.                     48.97°F         California / 38,066,920
 11   11.                     48.72°F            Arkansas / 2,947,036
 12   12.                     48.17°F            Oklahoma / 3,818,851
 13   13.                     47.21°F      North Carolina / 9,750,405
 14   14.                     46.90°F           Tennessee / 6,451,365
 15   15.                     44.54°F  District of Columbia / 633,736
 16   16.                     44.26°F            Virginia / 8,185,131
 17   17.                     44.25°F            Kentucky / 4,383,272
 18   18.                     44.21°F              Delaware / 917,060
 19   19.                     44.19°F            Maryland / 5,887,776
 20   20.                     43.84°F            Missouri / 6,028,076
 21   21.                     42.75°F              Nevada / 2,761,584
 22   22.                     42.72°F              Kansas / 2,882,946
 23   23.                     41.65°F             Indiana / 6,542,411
 24   24.                     41.61°F       West Virginia / 1,853,881
 25   25.                     41.45°F          New Jersey / 8,874,374
 26   26.                     41.18°F           Illinois / 12,868,747
 27   27.                     40.79°F               Ohio / 11,560,380
 28   28.                     40.76°F          Washington / 6,899,123
 29   29.                     40.11°F              Oregon / 3,900,343
 30   30.                     39.29°F       Pennsylvania / 12,758,729
 31   31.                     39.02°F        Rhode Island / 1,053,252
 32   32.                     38.34°F           New York / 19,594,330
 33   33.                     37.95°F         Connecticut / 3,592,053
 34   34.                     37.82°F            Nebraska / 1,855,617
 35   35.                     37.67°F                Iowa / 3,078,116
 36   36.                     37.63°F       Massachusetts / 6,657,291
 37   37.                     37.46°F          New Mexico / 2,080,085
 38   38.                     36.73°F            Michigan / 9,889,024
 39   39.                     36.27°F                Utah / 2,858,111
 40   40.                     34.44°F           Wisconsin / 5,724,692
 41   41.                     33.78°F          South Dakota / 834,708
 42   42.                     33.29°F               Idaho / 1,599,464
 43   43.                     33.23°F       New Hampshire / 1,321,069
 44   44.                     32.96°F               Vermont / 626,358
 45   45.                     32.53°F               Maine / 1,328,535
 46   46.                     32.49°F           Minnesota / 5,383,661
 47   47.                     31.65°F            Colorado / 5,197,580
 48   48.                     31.05°F             Montana / 1,006,370
 49   49.                     29.38°F          North Dakota / 704,925
 50   50.                     29.22°F               Wyoming / 575,251
 51   51.                     24.23°F                Alaska / 728,300]

In [4]:
table_max = pd.read_html(url_max)
table_max

[       0                           1                               2
 0   Rank  Average Max. Temperature ▼              State / Population
 1     1.                     81.97°F            Florida / 19,361,792
 2     2.                     80.66°F              Hawaii / 1,392,704
 3     3.                     80.59°F             Arizona / 6,561,516
 4     4.                     77.73°F              Texas / 26,092,033
 5     5.                     77.33°F           Louisiana / 4,601,049
 6     6.                     74.67°F         Mississippi / 2,984,345
 7     7.                     74.31°F             Alabama / 4,817,678
 8     8.                     73.90°F             Georgia / 9,907,756
 9     9.                     73.58°F      South Carolina / 4,727,273
 10   10.                     73.36°F         California / 38,066,920
 11   11.                     72.04°F            Oklahoma / 3,818,851
 12   12.                     71.64°F              Nevada / 2,761,584
 13   13.                     71.42°F            Arkansas / 2,947,036
 14   14.                     70.16°F      North Carolina / 9,750,405
 15   15.                     69.30°F           Tennessee / 6,451,365
 16   16.                     68.66°F          New Mexico / 2,080,085
 17   17.                     66.98°F            Kentucky / 4,383,272
 18   18.                     66.77°F            Virginia / 8,185,131
 19   19.                     66.58°F              Kansas / 2,882,946
 20   20.                     65.53°F            Missouri / 6,028,076
 21   21.                     65.08°F            Maryland / 5,887,776
 22   22.                     65.02°F  District of Columbia / 633,736
 23   23.                     64.62°F              Delaware / 917,060
 24   24.                     64.51°F       West Virginia / 1,853,881
 25   25.                     62.85°F                Utah / 2,858,111
 26   26.                     62.40°F          New Jersey / 8,874,374
 27   27.                     62.36°F              Oregon / 3,900,343
 28   28.                     61.91°F            Nebraska / 1,855,617
 29   29.                     61.91°F             Indiana / 6,542,411
 30   30.                     61.51°F           Illinois / 12,868,747
 31   31.                     60.94°F               Ohio / 11,560,380
 32   32.                     60.84°F            Colorado / 5,197,580
 33   33.                     60.31°F       Pennsylvania / 12,758,729
 34   34.                     60.09°F          Washington / 6,899,123
 35   35.                     59.56°F        Rhode Island / 1,053,252
 36   36.                     59.31°F               Idaho / 1,599,464
 37   37.                     59.27°F         Connecticut / 3,592,053
 38   38.                     58.61°F       Massachusetts / 6,657,291
 39   39.                     58.57°F                Iowa / 3,078,116
 40   40.                     58.01°F           New York / 19,594,330
 41   41.                     57.63°F               Wyoming / 575,251
 42   42.                     57.27°F             Montana / 1,006,370
 43   43.                     57.26°F          South Dakota / 834,708
 44   44.                     56.48°F            Michigan / 9,889,024
 45   45.                     55.69°F       New Hampshire / 1,321,069
 46   46.                     54.96°F           Wisconsin / 5,724,692
 47   47.                     54.48°F               Vermont / 626,358
 48   48.                     53.65°F               Maine / 1,328,535
 49   49.                     53.41°F           Minnesota / 5,383,661
 50   50.                     52.13°F          North Dakota / 704,925
 51   51.                     39.80°F                Alaska / 728,300]

## Average Min Temperature Values

In [5]:
# transfer list into dataframe

min_df = table_min[0]
min_df.head()

      0                           1                      2
0  Rank  Average Min. Temperature ▼     State / Population
1    1.                     65.09°F     Hawaii / 1,392,704
2    2.                     61.50°F   Florida / 19,361,792
3    3.                     56.07°F  Louisiana / 4,601,049
4    4.                     54.16°F     Texas / 26,092,033

In [6]:
# make column headers

min_df.columns = min_df.iloc[0]
min_df.head()

0  Rank  Average Min. Temperature ▼     State / Population
0  Rank  Average Min. Temperature ▼     State / Population
1    1.                     65.09°F     Hawaii / 1,392,704
2    2.                     61.50°F   Florida / 19,361,792
3    3.                     56.07°F  Louisiana / 4,601,049
4    4.                     54.16°F     Texas / 26,092,033

In [7]:
# drop first line

min_df = min_df.drop(min_df.index[0])

In [8]:
# drop rank column

min_df = min_df[['Average Min. Temperature ▼', 'State / Population']]
min_df.head()

0 Average Min. Temperature ▼       State / Population
1                    65.09°F       Hawaii / 1,392,704
2                    61.50°F     Florida / 19,361,792
3                    56.07°F    Louisiana / 4,601,049
4                    54.16°F       Texas / 26,092,033
5                    52.26°F  Mississippi / 2,984,345

In [9]:
# rename temp column 

min_df = min_df.rename(columns={'Average Min. Temperature ▼':'Avg Min Temp (F)'})
min_df.head()

0 Avg Min Temp (F)       State / Population
1          65.09°F       Hawaii / 1,392,704
2          61.50°F     Florida / 19,361,792
3          56.07°F    Louisiana / 4,601,049
4          54.16°F       Texas / 26,092,033
5          52.26°F  Mississippi / 2,984,345

In [10]:
# split State/Populatoin column

split = min_df['State / Population'].str.split(" / ", n = 1, expand = True) 
  
# making separate State column from new data frame 
min_df["State"]= split[0]
  
# Dropping old column 
min_df.drop(columns =['State / Population'], inplace = True)

In [11]:
# split F from temp values 

split_2 = min_df['Avg Min Temp (F)'].str.split('°F', n=1, expand=True)

min_df['Avg Min Temp (°F)'] = split_2[0]

min_df.drop(columns=['Avg Min Temp (F)'], inplace=True)

min_df.head()

0        State Avg Min Temp (°F)
1       Hawaii             65.09
2      Florida             61.50
3    Louisiana             56.07
4        Texas             54.16
5  Mississippi             52.26

In [12]:
min_df.dtypes

0
State                object
Avg Min Temp (°F)    object
dtype: object

In [13]:
# change temperature to numeric value

min_df['Avg Min Temp (°F)'] = pd.to_numeric(min_df['Avg Min Temp (°F)'])

In [14]:
min_df.dtypes

0
State                 object
Avg Min Temp (°F)    float64
dtype: object

In [15]:
min_df.to_csv("Resources/avg_min_temp.csv", index=False, header=True)

## Average Max Temperature

In [16]:
# transfer list into dataframe

max_df = table_max[0]
max_df.head()

      0                           1                     2
0  Rank  Average Max. Temperature ▼    State / Population
1    1.                     81.97°F  Florida / 19,361,792
2    2.                     80.66°F    Hawaii / 1,392,704
3    3.                     80.59°F   Arizona / 6,561,516
4    4.                     77.73°F    Texas / 26,092,033

In [17]:
# make column headers

max_df.columns = max_df.iloc[0]
max_df.head()

0  Rank  Average Max. Temperature ▼    State / Population
0  Rank  Average Max. Temperature ▼    State / Population
1    1.                     81.97°F  Florida / 19,361,792
2    2.                     80.66°F    Hawaii / 1,392,704
3    3.                     80.59°F   Arizona / 6,561,516
4    4.                     77.73°F    Texas / 26,092,033

In [18]:
# drop first line

max_df = max_df.drop(max_df.index[0])

In [19]:
# drop rank column

max_df = max_df[['Average Max. Temperature ▼', 'State / Population']]
max_df.head()

0 Average Max. Temperature ▼     State / Population
1                    81.97°F   Florida / 19,361,792
2                    80.66°F     Hawaii / 1,392,704
3                    80.59°F    Arizona / 6,561,516
4                    77.73°F     Texas / 26,092,033
5                    77.33°F  Louisiana / 4,601,049

In [20]:
# rename temp column 

max_df = max_df.rename(columns={'Average Max. Temperature ▼':'Avg Max Temp (F)'})
max_df.head()

0 Avg Max Temp (F)     State / Population
1          81.97°F   Florida / 19,361,792
2          80.66°F     Hawaii / 1,392,704
3          80.59°F    Arizona / 6,561,516
4          77.73°F     Texas / 26,092,033
5          77.33°F  Louisiana / 4,601,049

In [21]:
# split State/Populatoin column

split_3 = max_df['State / Population'].str.split(" / ", n = 1, expand = True) 
  
# making separate State column from new data frame 
max_df["State"]= split_3[0]
  
# Dropping old column 
max_df.drop(columns =['State / Population'], inplace = True)

In [22]:
# split F from temp values 

split_4 = max_df['Avg Max Temp (F)'].str.split('°F', n=1, expand=True)

max_df['Avg Max Temp (°F)'] = split_4[0]

max_df.drop(columns=['Avg Max Temp (F)'], inplace=True)

max_df.head()

0      State Avg Max Temp (°F)
1    Florida             81.97
2     Hawaii             80.66
3    Arizona             80.59
4      Texas             77.73
5  Louisiana             77.33

In [23]:
# change temperature to numeric value

max_df['Avg Max Temp (°F)'] = pd.to_numeric(max_df['Avg Max Temp (°F)'])

In [24]:
max_df.to_csv("Resources/avg_max_temp.csv", index=False, header=True)